// Напишите программу, которая будет выдавать название дня недели по заданному номеру.

string s_a = Console.ReadLine()!;

if (s_a == "1")
{
    Console.WriteLine("Понедельник");
}
 else if (s_a == "2")
{
    Console.WriteLine("Вторник");